cases/varprops/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1440
(
0.000416666666666
0.000416666666666
0.000416666666666
0.000416666666666
0.000416666666666
0.000416666666666
0.000416666666667
0.000416666666667
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
0.000416666666666
0.00125
0.00208333333333
0.00291666666666
0.00375
0.00458333333334
0.00541666666666
0.00625
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
0.000416666666666
0.00125
0.00208333333333
0.00291666666666
0.00375
0.00458333333333
0.00541666666667
0.00625
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
0.02
0.02
0.02
0.02
0.02
0.02
0.02
0.02
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
