cases/varprops/0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    inlet { type fixedValue; value uniform 300; }
    outlet { type zeroGradient; }
    bottomWall { type fixedValue; value uniform 340; }
    topWall { type zeroGradient; }
    frontAndBack { type empty; }
}
