cases/varprops/0/Ua
FoamFile { version 2.0; format ascii; class volVectorField; object Ua; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    inlet { type adjointInletVelocity; value uniform (0 0 0); }
    outlet { type adjointOutletVelocity; value uniform (0 0 0); }
    "(bottomWall|topWall)" { type adjointWallVelocity; value uniform (0 0 0); }
    frontAndBack { type empty; }
}
