cases/varprops/0/alpha
FoamFile { version 2.0; format ascii; class volScalarField; object alpha; }
dimensions [0 0 0 0 0 0 0];
internalField nonuniform List<scalar>
1440
(
0
0
0
0
0
0
0
0
...
)
;
boundaryField
{
    ".*" { type zeroGradient; }
    frontAndBack { type empty; }
}
