cases/varprops/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions
runApplication blockMesh
runApplication topoSet
[ -f system/setFieldsDict ] && runApplication setFields
runApplication $(getApplication)
