cases/varprops/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues ( volScalarFieldValue alpha 0 );
regions
(
    boxToCell { box (0.02 0.002 -1) (0.08 0.018 1); fieldValues ( volScalarFieldValue alpha 0.05 ); }
    boxToCell { box (0.03 0.004 -1) (0.06 0.016 1); fieldValues ( volScalarFieldValue alpha 0.35 ); }
);
